In [1]:
import pandas as pd
import sqlite3

In [2]:
#Create SQL Table
create_table = """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL); """

In [3]:
#execute the SQL statement
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [8]:
#prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score')

In [9]:
#fetch result from the SQLLite database

In [10]:
resulset=SQL_query.fetchall()

In [13]:
#view result (empty data)
resulset

[]

In [14]:
#prepare records to be inserted into SQL table through SQL statement
insertSQL = [(10, 'Jack', 85, 92),
             (29, 'Tom', 73, 89),
             (65, 'Ram', 65.5, 77),
             (5, 'Steve', 55, 91)]

In [15]:
#insert records into SQL table through SQL statement
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [16]:
#prepare SQL query
SQL_query = executeSQL.execute("select * from student_score")

In [17]:
#fetch the resultset for the query
resulset = SQL_query.fetchall()

In [18]:
#view the resultset
resulset

[(10, u'Jack', 85.0, 92.0),
 (29, u'Tom', 73.0, 89.0),
 (65, u'Ram', 65.5, 77.0),
 (5, u'Steve', 55.0, 91.0)]

In [20]:
#put the records together in dataframe
df_student_recors = pd.DataFrame(resulset, columns=zip(*SQL_query.description)[0])

In [21]:
#view the records in pandas dataframe
df_student_recors

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0